% B_plot.m

clear;
% define f(x)
f = @(x) 1 ./ (1 + x.^2);

% difine interpolation p(x)
p2 = @(x) 0.03846 + 0.1923*(x+5) - 0.03846*(x+5).*x;
p4 = @(x) 0.03846 + 0.03979*(x+5) + 0.06101*(x+5).*(x+2.5) ...
    - 0.02653*(x+5).*(x+2.5).*x + 0.005305*(x+5).*(x+2.5).*x.*(x-2.5);
p6 = @(x) 0.03846 + 0.02646*(x+5) + 0.02485*(x+5).*(x+3.333) ...
    + 0.01494*(x+5).*(x+3.333).*(x+1.667) ...
    - 0.01317*(x+5).*(x+3.333).*(x+1.667).*x ...
    + 0.004203*(x+5).*(x+3.333).*(x+1.667).*x.*(x-1.667) ...
    - 0.0008406*(x+5).*(x+3.333).*(x+1.667).*x.*(x-1.667).*(x-3.333);
p8 = @(x) 0.03846 + 0.02234*(x+5) + 0.01396*(x+5).*(x+3.75) ...
    + 0.0117*(x+5).*(x+3.75).*(x+2.5) + 0.0006743*(x+5).*(x+3.75).*(x+2.5).*(x+1.25) ...
    - 0.004896*(x+5).*(x+3.75).*(x+2.5).*(x+1.25).*x ...
    + 0.00244*(x+5).*(x+3.75).*(x+2.5).*(x+1.25).*x.*(x-1.25) ...
    - 0.0006872*(x+5).*(x+3.75).*(x+2.5).*(x+1.25).*x.*(x-1.25).*(x-2.5) ...
    + 0.0001374*(x+5).*(x+3.75).*(x+2.5).*(x+1.25).*x.*(x-1.25).*(x-2.5).*(x-3.75);

% create x's grid
x_vals = linspace(-5, 5, 1000);

% calculate
f_vals = f(x_vals);
p2_vals = p2(x_vals);
p4_vals = p4(x_vals);
p6_vals = p6(x_vals);
p8_vals = p8(x_vals);

% plot
figure;
plot(x_vals, f_vals, 'k', 'LineWidth', 2); % 函数 f(x) 用黑色线绘制
hold on;
plot(x_vals, p2_vals, '--r', 'LineWidth', 1.5); % n=2 的多项式用红色虚线
plot(x_vals, p4_vals, '--g', 'LineWidth', 1.5); % n=4 的多项式用绿色虚线
plot(x_vals, p6_vals, '--b', 'LineWidth', 1.5); % n=6 的多项式用蓝色虚线
plot(x_vals, p8_vals, '--m', 'LineWidth', 1.5); % n=8 的多项式用紫色虚线

legend('f(x) = 1 / (1 + x^2)', 'p(x), n=2', 'p(x), n=4', 'p(x), n=6', 'p(x), n=8', 'Location', 'Best');

xlabel('x');
ylabel('y');

grid on;
